app/Controllers/Api/Auth.php

    public function registration()
    {
        $success = false;
        $message = 'Gagal Proses Data';

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $no_telp = $this->request->getPost('notelp');
        $nama = $this->request->getPost('nama');
        $nik = $this->request->getPost('nik');
        $alamat = $this->request->getPost('alamat');
        $user_level = $this->request->getPost('user_level');

        $builderUsers = $this->db->table('user');
        $builderUsers->where(['email' => $email,]);
        $queryUsers    =  $builderUsers->get();

        if (empty($queryUsers->getNumRows())) {
            $dataValues['email'] = $email;
            $dataValues['password'] = md5($password);
            $dataValues['nama'] = $nama;
            $dataValues['nik'] = $nik;
            $dataValues['alamat'] = $alamat;
            $dataValues['no_telp'] = $no_telp;
            $dataValues['user_level'] = $user_level;
            $tgl_buat = date('Y-m-d H:i:s');
            $dataValues['date_created'] = $tgl_buat;

            $builderInserts = $this->db->table('user');
            $insertDatas =  $builderInserts->insert($dataValues);
---
SELECT *
FROM `user`
WHERE `email` = 'afifosama66@gmail.com'
INSERT INTO `user` (`id`, `email`, `password`, `nama`, `nik`, `no_telp`, `user_level`, `date_created`) VALUES (0, 'afifosama66@gmail.com', '12df8cac3790ea2a0dba5e627fed0ce4', 'Afif Osama', '3372022119032983', '081311992233', 3, '2022-12-12 01:11:33')

    public function login()
    {
        $success = false;
        $message = 'Gagal Proses Data';

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $builderUsers = $this->db->table('user');
        $builderUsers->where(['email' => $email, 'password' => md5($password)])->select('email, nama, user_level, no_telp, alamat');
        $queryUsers    =  $builderUsers->get();
---
SELECT `email`, `nama`, `user_level`, `no_telp`, `alamat`
FROM `user`
WHERE `email` = 'afifosama66@gmail.com'
AND `password` = '12df8cac3790ea2a0dba5e627fed0ce4'